<?php
return [
    
    /*
    |--------------------------------------------------------------------------
    | AES 配置
    |--------------------------------------------------------------------------
    | cipher            对称加密算法
    | options           加解返回数据格式
    | key_length        key长度
    | iv_length         iv长度
    |
    */

    'aes' => [
        'auth'       => 'aes-256-gcm',
        'options'    => OPENSSL_RAW_DATA,
        'key_length' => 32,
        'iv_length'  => 12,
    ],

    /*
    |--------------------------------------------------------------------------
    | RSA 配置
    |--------------------------------------------------------------------------
    | dir_permission    目录权限
    | private_path      私钥存放路径
    | public_path       公钥存放路径
    | padding           RSA 加密算法模式
    | algo              加密方式
    |
    */

    'rsa' => [
        'dir_permission' => 0755,
        'private_path'   => storage_path('app/ciphers/private.pem'),
        'public_path'    => storage_path('app/ciphers/public.pem'),
        'padding'        => OPENSSL_PKCS1_OAEP_PADDING,
        'algo'           => OPENSSL_ALGO_SHA256,
    ],

    /*
    |--------------------------------------------------------------------------
    | 重放验证
    |--------------------------------------------------------------------------
    | enabled           是否开启重放验证
    | ttl               重放时间(秒)
    |
    */

    'replay' => [
        'enabled' => true,
        'ttl'     => 300,
    ],

    /*
    |--------------------------------------------------------------------------
    | 签名配置
    |--------------------------------------------------------------------------
    | enabled           是否启用签名
    | separator         签名字符串连接符号
    |
    */

    'signature' => [
        'enabled'   => true,
        'separator' => "&",
    ],
];
